{
  "skill": {
    "card": {
      "angular": {
        "desc": "Angular a été le premier framework node que j'ai eu l'occasion de rencontrer pendant ma carrière. Depuis, j'ai eu l'opportunité de l'utiliser sur une multitude de projets, aussi bien en entreprise que pour des projets personnels.",
        "title": "Angular"
      },
      "formation": {
        "desc": "J'apprécie énormément l'enseignement et le partage de mes connaissances avec autrui. Pendant ma dernière expérience professionnelle, j'ai fréquemment assumé le rôle de référence technique pour mes collègues. Cela m'a permis d'améliorer ma capacité à transmettre mes connaissances, à élaborer des exercices et des présentations",
        "title": "Formation"
      },
      "java": {
        "desc": "Pendant plus de 5 ans, Java a été le langage de programmation que j'ai le plus utilisé. J'ai eu l'opportunité de participer à divers projets utilisant les versions 6, 8, 11 et 17 de Java. Au cours de cette période, j'ai acquis une expertise dans l'utilisation de technologies telles que Spring, SpringBoot, Maven, Hibernate et JUnit.",
        "title": "Java"
      },
      "jenkins": {
        "desc": "Jenkins occupe une place centrale dans mon processus d'intégration continue. Des tâches simples et spécifiques à un projet aux pipelines complexes et génériques, j'ai pu explorer toute la gamme de fonctionnalités offertes par Jenkins.",
        "title": "Jenkins CI/CD"
      },
      "sqldb": {
        "desc": "J'ai eu l'opportunité de collaborer sur divers projets qui ont tous nécessité l'utilisation d'une base de données SQL. Au cours de ma carrière, j'ai eu la chance de travailler avec différentes bases de données telles que Oracle, DB2 as400, Postgres et MariaDB. J'ai ainsi pu développer une expertise dans l'écriture de scripts SQL, allant du simple \"select\" à des procédures transactionnelles complexes."
      },
      "testing": {
        "desc": "J'ai toujours accordé une grande importance aux tests. La réalisation de tests pour une application est un aspect qui nécessite une réflexion constante tout au long de la durée de vie d'un projet. Les tests unitaires, les tests d'intégration et les tests bout en bout présentent chacun leurs avantages et leurs inconvénients. Je suis en mesure de vous accompagner dans la maîtrise de ces sujets afin d'obtenir des tests utiles et performants.",
        "title": "Test"
      }
    }
  }
}
