{
  "skill": {
    "card": {
      "angular": {
        "desc": "Angular a été le premier framework node que j'ai pu rencontrer pendant ma carrière. Je l'ai utilisé sur beaucoup de projets en entreprise ou pour des petits projets personnel.",
        "title": "Angular"
      },
      "formation": {
        "desc": "J'adore enseigner et partager mon savoir avec les autres. Dans mon expérience professionnel la plus récente; J'ai souvent pris le rôle d'une référence technique pour mes collègues de travail. Ceci ma aider à progresser dans ma transmission du savoir, écrire des exercice ou des présentations.",
        "title": "Formation"
      },
      "java": {
        "desc": "Java est le langage de programmation que j'ai le plus utiliser pendant plus de 5ans. J'ai eu la chance de travailler avec les versions 6, 8, 11 et  17. J'ai appris à maitriser des technologies comme Spring, SpringBoot, Maven, Hibernate et JUnit.",
        "title": "Java"
      },
      "jenkins": {
        "desc": "Jenkins est mon outils principal pour l'intégration continue. De simple tache spécifique à un projet jusqu'à des pipelines génériques complexes, j'ai pu faire l'expérience d'une large palette de fonctionnalités de Jenkins.",
        "title": "Jenkins CI/CD"
      },
      "sqldb": {
        "desc": "Tout les projets sur lesquels j'ai travaillé utilisait une base de donnée SQL. J'ai eu la chance de travailler sur des BDD Oracle, DB2 as400, Postgres et MariaDB. J'ai pu écrire, dans ma carrière, un large panel de scripts SQL, du simple select, à des procédures transactionnelles complexes."
      },
      "testing": {
        "desc": "J'ai toujours eu une attention particulière pour les tests. Tester une application est un sujet qui doit être penser et repense pendant toute la durée de vie d'un projet. Tests unitaires, tests d'intégration et tests bout en bout ont tous leurs avantages et inconvénient. Je peux vous aider à maitriser ces sujets pour un testing utile et performant.",
        "title": "Test"
      }
    }
  }
}
