{
  "skill": {
    "card": {
      "angular": {
        "desc": "During my professional journey, Angular emerged as the initial node framework I came across. Subsequently, I employed it in numerous projects ranging from enterprise-level applications to smaller personal endeavors.",
        "title": "Angular"
      },
      "formation": {
        "desc": "I have a deep passion for teaching and imparting knowledge to others. Throughout my recent work experience, I frequently assumed the position of a technical reference for my colleagues. This opportunity allowed me to enhance my teaching abilities and develop expertise in creating exercises and presentations.",
        "title": "Formation"
      },
      "java": {
        "desc": "For over 5 years, my primary area of expertise has been Java. Throughout this time, I have had the opportunity to work extensively with various versions of Java, including 6, 8, 11, and 17. Additionally, I have acquired a deep understanding of essential technologies such as Spring, Spring Boot, Maven, Hibernate, and JUnit.",
        "title": "Java"
      },
      "jenkins": {
        "desc": "I utilized Jenkins as my the primary tool for implementing CI pipelines. Throughout my experience, I employed Jenkins for various purposes, ranging from creating generic pipelines using libraries to executing project-specific CI tasks. This allowed me to explore and leverage a wide range of features offered by Jenkins in my workflow.",
        "title": "CI/CD Jenkins"
      },
      "sqldb": {
        "desc": "I have experience working on various projects that utilized SQL Databases. Throughout my career, I have had the opportunity to work with Oracle database, DB2 as400, Postgres, and MariaDB. I have written a wide range of SQL scripts, ranging from simple select statements to complex transactional procedures."
      },
      "testing": {
        "desc": "I have always held a particular interest in testing. Testing is a complex subject that requires careful consideration throughout the entire lifespan of a project. Unit tests, integration tests, and end-to-end testing each have their own advantages and drawbacks. I am capable of assisting you in achieving efficient and high-performance testing for your applications.",
        "title": "Testing"
      }
    }
  }
}
